01 COPY.
   10 CAMPO1-NOMBRE1 PIC S9(08)V99 DISPLAY.
   10 SUBESTRUCTURA1.
      12 SUBCAMPO1 PIC X(10).
      12 SUBCAMPO2 PIC 9999.
      12 SUBCAMPO3 PIC 9999.
   10 CAMPO2-NOMBRE2 PIC S9(02)V99 DISPLAY.
      14 SUBCAMPO3.
         16 OTROCAMPODENTRO PIC X.
   10 SUBESTRUCTURA2.
      12 SUBCAMPO1 PIC X(10).
      12 SUBCAMPO2 PIC 9999.


01 COPYNAME.
   10 CAMPO1 PIC X(10) VALUE '9'.
   10 CAMPO2 PIC 9(02).
   10 SWITCH PIC X.
      88 VALOR1 VALUE '1'.
      88 VALOR2 VALUE '2'.


01 COPY.
   02 SUBESTRUCTURA.
      03 CAMPO1 PIC X.
   02 SUBCONOCCURS OCCURS 3 TIMES.
      03 CAMPO3 PIC X(3).
      03 CAMPO4 PIC X(2).


01 COPY.
   02 SUBCONOCCURS PIC X OCCURS 2 TIMES.